Repository: inveniosoftware/invenio-records-resources
Catalog: invenio_records_resources/translations/*/LC_MESSAGES/messages.po
Languages: ar, cs, de, sv

source: Invalid reference for '%(key)s': %(obj)s
ar: مرجع غير صالح لـ '%(key)s' : %(obj)s
cs: Neplatná reference pro '%(key)s': %(obj)s
de: Ungültige Referenz für '%(key)s': %(obj)s
sv: Ogiltig referens för '%(key)s': %(obj)s

source: Invalid query string syntax.
ar: جملة البحث غير صالحة.
cs: Neplatný formát vyhledávacího výrazu.
de: Ungültige Abfrage-Syntax.
sv: Ogiltig syntax för frågesträng.

source: Misconfigured search.
ar: خطأ في تركيبة البحث.
cs: Špatně nastavené vyhledávání.
de: Falsch konfigurierte Suche.
sv: Felkonfigurerad sökning.

source: Internal server error
ar: خطأ بالموزّع الدّاخلي
cs: Vnitřní chyba serveru
de: Interner Serverfehler
sv: Internt serverfel

source: Invalid querystring parameters.
ar: إعدادات سلسلة الاستعلام querystring غير صالحة.
cs: Neplatné parametry vyhledávacího výrazu.
de: Ungültige Abfrageparameter.
sv: Ogiltiga parametrar för frågesträng.

source: Permission denied.
ar: تم رفض الإذن.
cs: Přístup odepřen.
de: Zugriff verweigert.
sv: Tillstånd nekat.

source: The record has been deleted.
ar: لقد تم حذف التسجيلة.
cs: Záznam byl vymazán.
de: Der Eintrag wurde gelöscht.
sv: Posten har raderats.

source: The persistent identifier is already registered.
ar: تم تسجيل المعرف الدّائم بالفعل.
cs: Persistentní identifikátor je již zaregistrován.
de: Der persistente Identifier ist bereits registriert.
sv: Den beständiga identifieraren är redan registrerad.

source: The persistent identifier does not exist.
ar: المعرف الدّائم غير موجود.
cs: Persistentní identifikátor neexistuje.
de: Der persistente Identifier existiert nicht.
sv: Den beständiga identifieraren finns inte.

source: The persistent identifier is not registered.
ar: لم يتم تسجيل المعرف الدّائم.
cs: Persistentní identifikátor není zaregistrován.
de: Der persistente Identifier ist nicht registriert.
sv: Den beständiga identifieraren är inte registrerad.

source: Not found.
ar: لم يتم العثور عليه.
cs: Nenalezeno
de: Nicht gefunden.
sv: Hittades inte.

source: Facet %(vocabulary_id)s not found.
ar: لم يتم العثور على الوجه Facet %(vocabulary_id)s.
cs: Faceta %(vocabulary_id)s nebyla nalezena.
de: Facette %(vocabulary_id)s nicht gefunden.
sv: Facetten %(vocabulary_id)s hittades inte.

source: Unable to decode JSON data in request body.
ar: غير قادر على فك تشفير بيانات JSON في نص الطلب.
cs: Nelze dekódovat JSON data v těle požadavku.
de: JSON-Daten im Anforderungstext können nicht decodiert werden.
sv: Det gick inte att avkoda JSON-datan i begäran.

source: Not a valid value.
ar: قيمة غير صالحة.
cs: Nejde o platnou hodnotu.
de: Kein gültiger Wert.
sv: Inte ett giltigt värde.

source: The file upload transfer failed, please try again.
ar: فشل في عملية نقل تحميل الملف، يرجى المحاولة مرة أخرى.
cs: Nahrávání souboru selhalo, prosím zkuste to znovu.
de: Der Datei-Upload-Vorgang ist fehlgeschlagen. Bitte versuchen Sie es erneut.
sv: Filuppladdningen misslyckades, försök igen.

source: Uploading selected files will result in exceeding the max amount per record.
ar: سيؤدي تحميل الملفات المختارة إلى تجاوز الحد الأقصى لكل سجل.
cs: Nahrání vybraných souborů způsobí překročení maximálního limitu na záznam.
de: Das Hochladen der ausgewählten Dateien würde zu einer Überschreitung der maximalen Anzahl pro Datensatz führen.
sv: Om du laddar upp de valda filerna kommer det att leda till att maxantalet per post överskrids.

source: Revision id provided(%(expected_revision_id)s) doesn't match record's one(%(record_revision_id)s)
ar: معرف المراجعة المقدم(%(expected_revision_id)s) لا يتطابق مع معرف التسجيلة(%(record_revision_id)s)
cs: Poskytnuté ID revize (%(expected_revision_id)s) neodpovídá ID revize záznamu (%(record_revision_id)s).
de: Die angegebene Revisions-ID (%(expected_revision_id)s) stimmt nicht mit der Revisions-ID des Datensatzes (%(record_revision_id)s) überein.
sv: Det angivna Revision id:et(%(expected_revision_id)s) stämmer inte överrens med postens(%(record_revision_id)s)

source: Facet %(vocab)s not found.
ar: لم يتم العثور على الوجه Facet %(vocab)s.
cs: Faceta %(vocab)s nebyla nalezena.
de: Facette %(vocab)s nicht gefunden.
sv: Facetten %(vocab)s hittades inte.

source: Record '%(recid)s' has no file '%(file_key)s'.
ar: التسجيلة '%(recid)s' لا تحتوي ملف '%(file_key)s'.
cs: Záznam '%(recid)s' nemá soubor '%(file_key)s'.
de: Der Datensatz '%(recid)s' hat keine Datei '%(file_key)s'.
sv: Posten '%(recid)s' har ingen fil '%(file_key)s'.

source: Record '%(recid)s' failed to upload file '%(file_key)s'.
ar: التسجيلة '%(recid)s' فشلت في تحميل الملف '%(file_key)s'.
cs: Chyba nahrání souboru '%(file_key)s' do záznamu '%(recid)s'.
de: Der Upload der Datei '%(file_key)s' für den Datensatz '%(recid)s' ist fehlgeschlagen.
sv: Posten '%(recid)s' misslyckades med att ladda upp filen '%(file_key)s'.

source: Uploading the selected files would result in {files_count} files (max is {max_files}).
ar: حصيلة تحميل الملفات المحددة {files_count} ملفا (max is {max_files}).
cs: Aktualizace vybraných souborů by znamenala změnu {files_count} souborů (max je {max_files}).
de: Das Hochladen der ausgewählten Dateien würde zu einer Gesamtzahl von {files_count} Dateien führen. (Maximal erlaubt sind {max_files} Dateien.)
sv: Uppladdning av de valda filerna skulle resultera i {files_count} filer (max är {max_files}).

source: Namespace %(given_namespace)s is not valid for custom field %(field_name)s.
ar: إسم المجال Namespace %(given_namespace)s غير صالح للحقل المخصص %(field_name)s.
cs: Pro vlastní pole %(field_name)s není jmenný prostor %(given_namespace)s platný.
de: Der Namespace %(given_namespace)s ist nicht gültig für das benutzerdefinierte Feld %(field_name)s.
sv: Namnrymden %(given_namespace)s är inte giltig för anpassat fält %(field_name)s.

source: Custom fields %(field_names)s are not configured.
ar: الحقول المخصصة %(field_names)s لم يقع تهيئتها.
cs: Vlastní pole %(field_names)s nejsou nakonfigurována.
de: Die benutzerdefinierten Felder %(field_names)s sind nicht konfiguriert.
sv: Anpassade fält %(field_names)s är inte konfigurerade.

source: Invalid argument %(arg_name)s passed when initializing custom field.
ar: تبرير غير صالحة %(arg_name)s تم تمريره عند تهيئة الحقل المخصص.
cs: Neplatný argument %(arg_name)s předán při inicializaci vlastního pole.
de: Ungültiges Argument %(arg_name)s beim Initialisieren des benutzerdefinierten Felds.
sv: Ogiltigt argument %(arg_name)s vid initiering av anpassat fält.

source: File upload transfer failed.
ar: فشل في تحويل تحميل ملف.
cs: Nahrávání souboru selhalo.
de: Datei-Upload-Vorgang fehlgeschlagen.
sv: Filuppladdningen misslyckades.

source: File size limit exceeded.
ar: تم تجاوز الحد الأقصى لحجم الملف.
cs: Překročen limit velikosti souborů.
de: Dateigrößen-Limit überschritten.
sv: Gränsen för filstorlek har överskridits.

source: Empty files are not accepted.
ar: الملفات الخاوية مرفوضة.
cs: Prázdné soubory nejsou povoleny.
de: Leere Dateien werden nicht akzeptiert.
sv: Tomma filer accepteras inte.

source: Best match
ar: أفضل تطابق
cs: Dle nejlepší shody
de: Beste Übereinstimmung
sv: Bästa matchningen

source: Newest
ar: الأحدث
cs: Od nejnovějšího
de: Neuster
sv: Nyast

source: Oldest
ar: الأقدم
cs: Od nejstaršího
de: Ältester
sv: Äldst

source: You must first delete all files to set the record to be metadata-only.
ar: يجب حذف جميع الملفات أولاً لتتمكن من إعادة إعدادات تّسجيلة ذات بيانات وصفية فقط.
cs: Musíte smazat všechny soubory před tím, než nastavíte záznam jako čistě metadatový.
de: Sie müssen zuerst alle Dateien löschen, um den Eintrag als "Reiner Metadateneintrag" kennzeichnen zu können.
sv: Du måste först radera alla filer för att ställa in att posten endast ska innehålla metadata.

source: Invalid pagination parameters.
ar: إعدادات الترقيم غير صالحة.
cs: Neplatné parametry stránkování.
de: Ungültige Paginierungsparameter.
sv: Ogiltiga parametrar för paginering.

source: You cannot specify both 'q' and 'suggest' parameters at the same time.
ar: لا يمكنك تحديد كل من الإعدادين إستعلم "q" و إقترح "suggest" في نفس الوقت.
cs: Nemůžete současně zadat parametry 'q' a 'suggest'.
de: Sie können die Parameter 'q' und 'suggest' nicht gleichzeitig angeben.
sv: Du kan inte ange både parametrarna ’q’ och ’suggest’ samtidigt.

source: Invalid 'suggest' parameter.
ar: تهيئة إقترح 'suggest' غير صالحة.
cs: Neplatný parametr 'suggest'.
de: Ungültiger 'suggest'-Parameter.
sv: Ogiltig 'suggest' parameter.

source: Invalid sort option '%(sort_option)s'.
ar: خيار فرز غير صالح '%(sort_option)s'.
cs: Neplatná možnost řazení '%(sort_option)s'.
de: Ungültige Sortieroption '%(sort_option)s'.
sv: Ogiltigt sorteringsalternativ '%(sort_option)s'.

source: Invalid search field: %(field_name)s.
ar: حقل بحث غير صالح:%(field_name)s.
cs: Špatné vyhledávací pole: %(field_name)s.
de: Ungültiges Suchfeld: %(field_name)s.
sv: Ogiltigt sökfält: %(field_name)s.
